/** 

🇫‌🇱‌🇦‌🇸‌🇭‌-🇲‌🇩‌ 

  𝗖𝗼𝗽𝘆𝗿𝗶𝗴𝗵𝘁 (𝗖) 2024.
 𝗟𝗶𝗰𝗲𝗻𝘀𝗲𝗱 𝘂𝗻𝗱𝗲𝗿 𝘁𝗵𝗲  𝗠𝗜𝗧 𝗟𝗶𝗰𝗲𝗻𝘀𝗲;
 𝗬𝗼𝘂 𝗺𝗮𝘆 𝗻𝗼𝘁 𝘂𝘀𝗲 𝘁𝗵𝗶𝘀 𝗳𝗶𝗹𝗲 𝗲𝘅𝗰𝗲𝗽𝘁 𝗶𝗻 𝗰𝗼𝗺𝗽𝗹𝗶𝗮𝗻𝗰𝗲 𝘄𝗶𝘁𝗵 𝘁𝗵𝗲 𝗟𝗶𝗰𝗲𝗻𝘀𝗲.
 𝗜𝘁 𝗶𝘀 𝘀𝘂𝗽𝗽𝗹𝗶𝗲𝗱 𝗶𝗻 𝘁𝗵𝗲 𝗵𝗼𝗽𝗲 𝘁𝗵𝗮𝘁 𝗶𝘁 𝗺𝗮𝘆 𝗯𝗲 𝘂𝘀𝗲𝗳𝘂𝗹.
 * @𝗽𝗿𝗼𝗷𝗲𝗰𝘁_𝗻𝗮𝗺𝗲 : 𝗙𝗹𝗮𝘀𝗵 𝗠𝗗, 𝗮 𝘀𝗶𝗺𝗽𝗹𝗲 𝗮𝗻𝗱 𝗲𝗮𝘀𝘆 𝗪𝗵𝗮𝘁𝘀𝗔𝗽𝗽 𝘂𝘀𝗲𝗿 𝗯𝗼𝘁 
 * @𝗼𝘄𝗻𝗲𝗿: 𝗙𝗿𝗮𝗻𝗰𝗲 𝗞𝗶𝗻𝗴 
 
 **/











const { france } = require("../framework/france");
const moment = require("moment-timezone");
const { default: axios } = require('axios');
//const conf = require('../set');


france({ nomCom: 'bing',
    desc: 'To check bing',
    Categorie: 'General',
    reaction: '💫', 
    fromMe: 'true', 

       
  },
  async (dest, zk, commandeOptions) => {
    const { ms, arg, repondre } = commandeOptions;
    const { start} = new Date().getTime()
    return repondre('*bing⟼⟼⟼⟼⟼❍❍𝗽𝗼𝘄𝗲𝗿𝗱▰▰▰𝗯𝘆⇀⇀𝗿𝘂𝘀𝗵⟼▉▁▂▃▄▅▆▇█▉⟼⟼⟼⟼██████████████⟼██████████████████████████████████████████████████████████████████████████⟼⇀⇀⇀⇀🇱🇰⇀𝘀𝗿𝗶⇀𝗹𝗮𝗻𝗸𝗮𝗻⇀♻⇀⇀⇀⇀⇀⇀⇀⇀⇀⇀♻⇀⇀⇀⇀⇀⇀⇀⇀⇀⇀🤍𝗰𝗼𝗱𝗲𝗱⟼𝗯𝘆⇀𝗿𝘂𝘀𝗵⟼😍𝗰𝗿𝗲𝗮𝘁𝗲❍𝗱𝗮𝘁𝗲⟼𝗶𝘀♻♻2024𝗷𝘂𝗻𝗲1⇀⇀⇀⇀⇀♻↻↻↻↻↻↻⇀⇀⇀⇀♻█████████████████████████████████████████████████𝗺𝗲𝗻𝘂⟼𝘁𝘆𝗽𝗲⟼𝗯𝗼𝘁⟼⟼█████████████████𝗺𝗲𝗻𝘂⟼𝘁𝘆𝗽𝗲⟼𝗴𝗽𝘁█████████████████████████████████████████████████████♻♻♻♻♻♻♻♻♻♻⇀⇀⇀↻↻↻❍❍❍❍❍❍❍❍█𝗴𝗮𝗺𝗲𝘀❍█████████████████████!!*\n ```' + 2000 + '``` *ms*') 
    const { end } = new Date().getTime()
    await zok.sendMessage('*Pong!*\n ```' + (end - start) + '``` *ms*')
  }
)
